In [1]:
import pandas as pd
import numpy as np
from pandas import Series, DataFrame

In [3]:
dframe = DataFrame({'k1': ['X', 'X', 'Y', 'Y', 'Z'],
                                       'k2': ['alpha', 'beta', 'alpha', 'beta', 'alpha'],
                                       'dataset1': np.random.randn(5),
                                       'dataset2': np.random.randn(5)})
dframe

  k1     k2  dataset1  dataset2
0  X  alpha -0.590607  0.427682
1  X   beta -0.607552 -0.516685
2  Y  alpha -0.095411  0.432728
3  Y   beta -0.652841  0.097519
4  Z  alpha -0.343884  0.027431

In [4]:
group1 = dframe['dataset1'].groupby(dframe['k1'])
group1

In [5]:
group1.mean()

k1
X   -0.599080
Y   -0.374126
Z   -0.343884
Name: dataset1, dtype: float64

In [7]:
dframe.groupby('k1')['dataset1'].mean()

k1
X   -0.599080
Y   -0.374126
Z   -0.343884
Name: dataset1, dtype: float64

In [8]:
cities = np.array(['NY', 'LA', 'LA', 'NY', 'NY'])
month = np.array(['JAN', 'FEB', 'JAN', 'FEB', 'JAN' ])

dframe['dataset1'].groupby([cities,month]).mean()

LA  FEB   -0.607552
    JAN   -0.095411
NY  FEB   -0.652841
    JAN   -0.467246
Name: dataset1, dtype: float64

In [9]:
 dframe

  k1     k2  dataset1  dataset2
0  X  alpha -0.590607  0.427682
1  X   beta -0.607552 -0.516685
2  Y  alpha -0.095411  0.432728
3  Y   beta -0.652841  0.097519
4  Z  alpha -0.343884  0.027431

In [10]:
dframe.groupby(['k1', 'k2']).mean()

          dataset1  dataset2
k1 k2
X  alpha -0.590607  0.427682
   beta  -0.607552 -0.516685
Y  alpha -0.095411  0.432728
   beta  -0.652841  0.097519
Z  alpha -0.343884  0.027431

In [11]:
dataset2_group = dframe.groupby(['k1', 'k2'])[['dataset2']]
dataset2_group.mean()

          dataset2
k1 k2
X  alpha  0.427682
   beta  -0.516685
Y  alpha  0.432728
   beta   0.097519
Z  alpha  0.027431

In [13]:
dframe.groupby(['k1']).size()

k1
X    2
Y    2
Z    1
dtype: int64

In [15]:
for name, group in dframe.groupby('k1'):
    print(f'Group: {name}')
    print(group)
    print('\n')

Group: X
  k1     k2  dataset1  dataset2
0  X  alpha -0.590607  0.427682
1  X   beta -0.607552 -0.516685


Group: Y
  k1     k2  dataset1  dataset2
2  Y  alpha -0.095411  0.432728
3  Y   beta -0.652841  0.097519


Group: Z
  k1     k2  dataset1  dataset2
4  Z  alpha -0.343884  0.027431

In [18]:
for (k1, k2), group in dframe.groupby(['k1', 'k2']):
    print(f'Key1 = {k1} Key2 = {k2}')
    print(group)
    print("\n")

Key1 = X Key2 = alpha
  k1     k2  dataset1  dataset2
0  X  alpha -0.590607  0.427682


Key1 = X Key2 = beta
  k1    k2  dataset1  dataset2
1  X  beta -0.607552 -0.516685


Key1 = Y Key2 = alpha
  k1     k2  dataset1  dataset2
2  Y  alpha -0.095411  0.432728


Key1 = Y Key2 = beta
  k1    k2  dataset1  dataset2
3  Y  beta -0.652841  0.097519


Key1 = Z Key2 = alpha
  k1     k2  dataset1  dataset2
4  Z  alpha -0.343884  0.027431

In [20]:
gr = dframe.groupby("k1")
gr.get_group('X')

  k1     k2  dataset1  dataset2
0  X  alpha -0.590607  0.427682
1  X   beta -0.607552 -0.516685

In [21]:
list(dframe.groupby('k1'))

[('X',
    k1     k2  dataset1  dataset2
  0  X  alpha -0.590607  0.427682
  1  X   beta -0.607552 -0.516685),
 ('Y',
    k1     k2  dataset1  dataset2
  2  Y  alpha -0.095411  0.432728
  3  Y   beta -0.652841  0.097519),
 ('Z',
    k1     k2  dataset1  dataset2
  4  Z  alpha -0.343884  0.027431)]

In [22]:
dict([('key1', 1), ('key2', 2), ('key3', 3)])

{'key1': 1, 'key2': 2, 'key3': 3}

In [23]:
group_dict = dict(list(dframe.groupby('k1')))
group_dict[('X')]

  k1     k2  dataset1  dataset2
0  X  alpha -0.590607  0.427682
1  X   beta -0.607552 -0.516685